[
    {
      "name": "Satoshi Nakamura",
      "id": 1001,
      "image": "https://example.com/images/chef-satoshi-nakamura.jpg",
      "years_of_experience": 15,
      "number_of_recipes": 120,
      "likes": 2500,
      "bio": "Chef Satoshi Nakamura is a master of traditional Japanese cuisine, known for his impeccable attention to detail and dedication to quality ingredients. He has honed his skills over 15 years working in some of the finest restaurants in Japan, and now delights diners with his exquisite creations at our restaurant.",
      "recipes": [
        {
          "name": "Sushi",
          "id": 2001,
          "ingredients": [
            "sushi rice",
            "nori",
            "raw fish or other fillings (e.g. avocado, cucumber, shrimp)",
            "wasabi",
            "soy sauce"
          ],
          "cooking_method": " Cook the sushi rice. Prepare the fillings. Lay out a sheet of nori. Spread the rice onto the nori. Add the fillings. Roll the sushi. Cut into pieces. Serve with wasabi and soy sauce",
          "rating": 4.5
        },
        {
          "name": "Tempura",
          "id": 2002,
          "ingredients": [
            "shrimp or vegetables",
            "flour",
            "cornstarch",
            "egg",
            "cold water"
          ],
          "cooking_method": " Prepare the batter. Heat the oil. Dip the shrimp or vegetables in the batter. Fry until golden brown. Serve hot",
          "rating": 4.2
        },
        {
          "name": "Ramen",
          "id": 2003,
          "ingredients": [
            "ramen noodles",
            "pork broth",
            "sliced pork",
            "green onions",
            "bean sprouts"
          ],
          "cooking_method": " Prepare the broth. Cook the noodles. Slice the pork. Chop the green onions. Assemble the ramen bowl. Serve hot",
          "rating": 4.7
        }
      ]
      
    },
    {
      "name": "Yui Tanaka",
      "id": 1002,
      "image": "https://example.com/images/chef-yui-tanaka.jpg",
      "years_of_experience": 10,
      "number_of_recipes": 90,
      "likes": 1500,
      "bio": "Chef Yui Tanaka brings a fresh perspective to traditional Japanese cuisine, infusing her dishes with modern techniques and bold flavors. With 10 years of experience in top kitchens across Japan and Europe, she is a rising star in the culinary world and a beloved member of our team.",
      "recipes": [
        {
          "name": "Miso Soup",
          "id": 2004,
          "ingredients": [
            "dashi stock",
            "miso paste",
            "tofu",
            "green onions",
            "seaweed"
          ],
          "cooking_method": " Prepare the dashi stock. Add the miso paste. Add the tofu. Add the green onions and seaweed. Serve hot",
          "rating": 4.0
        },
        {
          "name": "Yakitori",
          "id": 2005,
          "ingredients": [
            "chicken thighs",
            "soy sauce",
            "sake",
            "mirin",
            "green onions"
          ],
          "cooking_method": " Prepare the sauce. Cut the chicken into small pieces. Thread the chicken onto skewers. Grill over high heat. Baste with the sauce. Sprinkle with chopped green onions. Serve hot",
          "rating": 4.3
        },
        {
          "name": "Soba Noodles",
          "id": 2006,
          "ingredients": [
            "soba noodles",
            "dipping sauce",
            "wasabi",
            "green onions",
            "tempura flakes"
          ],
          "cooking_method": " Boil the soba noodles. Rinse the noodles in cold water. Prepare the dipping sauce. Grate the wasabi. Chop the green onions. Arrange the noodles on a plate. Sprinkle with tempura flakes. Serve with the dipping sauce, wasabi, and green onions",
          "rating": 4.1
        }
      ]
      
    },
    {
      "name": "Hiroshi Yamamoto",
      "id": 1003,
      "image": "https://example.com/images/chef-hiroshi-yamamoto.jpg",
      "years_of_experience": 20,
      "number_of_recipes": 150,
      "likes": 3000,
      "bio": "Chef Hiroshi Yamamoto is a true master of the art of Japanese cuisine, with over 20 years of experience and a deep knowledge of traditional techniques and ingredients. He has trained under some of the most respected chefs in Japan and continues to push the boundaries of culinary excellence at our restaurant.",
      "recipes": [
        {
          "name": "Tonkatsu",
          "id": 2008,
          "ingredients": [
            "pork loin",
            "flour",
            "eggs",
            "panko bread crumbs",
            "cabbage"
          ],
          "cooking_method": " Pound the pork loin until it is evenly thin. Season the pork with salt and pepper. Dredge the pork in flour, shaking off any excess. Dip the pork into beaten eggs. Coat the pork in panko bread crumbs. Deep-fry the pork until golden brown and cooked through. Serve with shredded cabbage and tonkatsu sauce",
          "rating": 4.2
        },
        {
          "name": "Sukiyaki",
          "id": 2009,
          "ingredients": [
            "sliced beef",
            "tofu",
            "enoki mushrooms",
            "nappa cabbage",
            "shirataki noodles"
          ],
          "cooking_method": " Heat a skillet over high heat and add sliced beef. Add tofu, enoki mushrooms, nappa cabbage, and shirataki noodles. Add soy sauce, sugar, and mirin. Cook until the ingredients are tender and the sauce is thickened. Serve hot",
          "rating": 4.5
        },
        {
          "name": "Mochi Ice Cream",
          "id": 2010,
          "ingredients": [
            "mochiko flour",
            "sugar",
            "cornstarch",
            "ice cream",
            "food coloring"
          ],
          "cooking_method": " Mix mochiko flour, sugar, and water together. Microwave the mixture until it forms a sticky dough. Roll out the dough and cut into circles. Wrap the circles around scoops of ice cream. Freeze until firm. Serve and enjoy!",
          "rating": 4.8
        }
      ]
      
    },
    {
      "name": "Ayumi Sato",
      "id": 1004,
      "image": "https://example.com/images/chef-ayumi-sato.jpg",
      "years_of_experience": 8,
      "number_of_recipes": 80,
      "likes": 1200,
      "bio": "Chef Ayumi Sato is a rising star in the world of Japanese cuisine, with a passion for bold flavors and playful presentations. With 8 years of experience in top restaurants in Japan and the United States, she brings a unique perspective to our menu and delights diners with her innovative creations.",
      "recipes": [
        {
          "name": "Okonomiyaki",
          "id": 2011,
          "ingredients": [
            "flour",
            "water",
            "cabbage",
            "eggs",
            "bacon"
          ],
          "cooking_method": " Mix flour and water to make a batter. Add shredded cabbage and eggs to the batter. Heat a skillet over medium heat and add bacon. Pour the batter onto the skillet and cook until the bottom is golden brown. Flip the okonomiyaki and cook until the other side is golden brown. Serve with okonomiyaki sauce and mayonnaise",
          "rating": 4.4
        },
        {
          "name": "Tempura",
          "id": 2012,
          "ingredients": [
            "shrimp",
            "vegetables",
            "flour",
            "cold water",
            "salt"
          ],
          "cooking_method": " Mix flour, cold water, and salt to make a batter. Dip shrimp and vegetables into the batter. Deep-fry the shrimp and vegetables until golden brown. Serve with tempura dipping sauce",
          "rating": 4.7
        },
        {
          "name": "Taiyaki",
          "id": 2013,
          "ingredients": [
            "flour",
            "sugar",
            "eggs",
            "baking powder",
            "red bean paste"
          ],
          "cooking_method": " Mix flour, sugar, eggs, and baking powder to make a batter. Heat a taiyaki mold over medium heat. Pour the batter into the mold and add a spoonful of red bean paste. Cover the red bean paste with more batter. Cook until both sides are golden brown. Serve hot",
          "rating": 4.6
        }
      ]
      
    },
    {
      "name": "David Takahashi",
      "id": 1005,
      "image": "https://example.com/images/chef-david-takahashi.jpg",
      "years_of_experience": 12,
      "number_of_recipes": 100,
      "likes": 2000,
      "bio": "David Takahashi is a master of Japanese cuisine, blending traditional techniques with modern flavors to create dishes that are both familiar and exciting. With 12 years of experience in top kitchens across Japan and the United States, he is a beloved member of our team and a rising star in the culinary world.",
      "recipes":[
        {
          "name": "Tonkatsu",
          "id": 2014,
          "ingredients": [
            "pork cutlets",
            "flour",
            "eggs",
            "panko bread crumbs",
            "vegetable oil"
          ],
          "cooking_method": " Season the pork cutlets with salt and pepper. Coat the cutlets in flour, dip in beaten eggs, and coat in panko bread crumbs. Heat vegetable oil in a frying pan over medium heat. Fry the cutlets until golden brown on both sides. Drain excess oil and serve with tonkatsu sauce",
          "rating": 4.5
        },
        {
          "name": "Nikujaga",
          "id": 2015,
          "ingredients": [
            "thinly sliced beef",
            "potatoes",
            "onion",
            "carrots",
            "soy sauce"
          ],
          "cooking_method": " Cut potatoes, onion, and carrots into bite-sized pieces. Sauté the vegetables in a pot until lightly browned. Add thinly sliced beef and sauté until browned. Add water and bring to a boil. Add soy sauce and simmer until the vegetables are tender. Serve hot",
          "rating": 4.3
        },
        {
          "name": "Matcha Ice Cream",
          "id": 2016,
          "ingredients": [
            "heavy cream",
            "whole milk",
            "sugar",
            "egg yolks",
            "matcha powder"
          ],
          "cooking_method": " Heat heavy cream, whole milk, and sugar in a pot until the sugar dissolves. In a separate bowl, whisk egg yolks and matcha powder until smooth. Slowly pour the hot milk mixture into the egg yolk mixture, whisking constantly. Pour the mixture back into the pot and cook over low heat, stirring constantly, until the mixture thickens. Chill the mixture in the refrigerator for several hours or overnight. Pour the chilled mixture into an ice cream maker and churn according to the manufacturer's instructions. Serve the matcha ice cream plain or with toppings",
          "rating": 4.8
        }
      ]
      
    },
    {
      "name": "Olivia Nakamura",
      "id": 1006,
      "image": "https://example.com/images/chef-olivia-nakamura.jpg",
      "years_of_experience": 9,
      "number_of_recipes": 70,
      "likes": 1400,
      "bio": "Olivia Nakamura brings a fresh perspective to traditional Japanese cuisine, infusing her dishes with bold flavors and creative presentations. With 9 years of experience in top restaurants in Japan and the United States, she is a rising star in the culinary world and a valuable member of our team.",
      "recipes": [
        {
          "name": "Tempura",
          "id": 2017,
          "ingredients": [
            "shrimp",
            "vegetables (such as eggplant, sweet potato, and bell pepper)",
            "flour",
            "ice water",
            "vegetable oil"
          ],
          "cooking_method": " Cut the shrimp and vegetables into bite-sized pieces. In a bowl, mix flour and ice water until the batter is smooth. Dip the shrimp and vegetables in the batter, shaking off any excess. Heat vegetable oil in a frying pan over high heat. Fry the shrimp and vegetables until the batter is crispy and golden brown. Drain excess oil and serve with tentsuyu dipping sauce",
          "rating": 4.6
        },
        {
          "name": "Soba Noodles",
          "id": 2018,
          "ingredients": [
            "soba noodles",
            "dashi broth",
            "mirin",
            "soy sauce",
            "green onions"
          ],
          "cooking_method": " Cook soba noodles in boiling water for 4-5 minutes. Drain the noodles and rinse with cold water. In a pot, combine dashi broth, mirin, and soy sauce and bring to a boil. Add the soba noodles and cook for 1-2 minutes. Serve hot or cold, garnished with chopped green onions",
          "rating": 4.4
        },
        {
          "name": "Mochi",
          "id": 2019,
          "ingredients": [
            "mochiko (sweet rice flour)",
            "sugar",
            "water",
            "cornstarch",
            "red bean paste"
          ],
          "cooking_method": " In a bowl, mix mochiko, sugar, and water until the mixture is smooth. Pour the mixture into a microwave-safe dish and microwave for 2-3 minutes until the mixture is cooked and firm. Sprinkle cornstarch on a work surface and transfer the mochi onto it. Cut the mochi into bite-sized pieces and fill each piece with a spoonful of red bean paste. Fold the edges of the mochi over the filling and pinch to seal",
          "rating": 4.7
        }
      ]
      
    },
    {
      "name": "Michael Ishikawa",
      "id": 1007,
      "image": "https://example.com/images/chef-michael-ishikawa.jpg",
      "years_of_experience": 15,
      "number_of_recipes": 120,
      "likes": 2200,
      "bio": "Michael Ishikawa is a master of Japanese cuisine, with a deep knowledge of traditional techniques and ingredients. With 15 years of experience in top kitchens across Japan and the United States, he is a respected member of the culinary community and a key member of our team.",
      "recipes": [
        {
          "name": "Gyoza",
          "id": 2020,
          "ingredients": [
            "ground pork",
            "cabbage",
            "garlic",
            "ginger",
            "soy sauce",
            "sesame oil",
            "gyoza wrappers"
          ],
          "cooking_method": " In a bowl, mix ground pork, finely chopped cabbage, minced garlic and ginger, soy sauce, and sesame oil. Place a spoonful of the filling in the center of a gyoza wrapper. Wet the edges of the wrapper with water and fold it in half, pinching the edges to seal. Heat vegetable oil in a frying pan over medium-high heat. Place the gyoza in the pan and cook until the bottoms are golden brown. Add water to the pan and cover with a lid to steam the gyoza for 3-4 minutes. Serve with dipping sauce",
          "rating": 4.5
        },
        {
          "name": "Yakitori",
          "id": 2021,
          "ingredients": [
            "chicken (breast or thigh)",
            "green onions",
            "soy sauce",
            "mirin",
            "sugar",
            "sesame seeds"
          ],
          "cooking_method": " Cut the chicken and green onions into bite-sized pieces. Thread the chicken and green onions onto skewers. In a bowl, mix soy sauce, mirin, and sugar to make the yakitori sauce. Grill or broil the skewers until the chicken is cooked through and the edges are charred. Brush the yakitori sauce on both sides of the skewers and continue cooking until the sauce is caramelized. Serve hot, garnished with sesame seeds",
          "rating": 4.3
        },
        {
          "name": "Matcha Green Tea Ice Cream",
          "id": 2022,
          "ingredients": [
            "heavy cream",
            "whole milk",
            "sugar",
            "matcha green tea powder",
            "egg yolks"
          ],
          "cooking_method": " In a saucepan, heat heavy cream, whole milk, and sugar over medium heat. In a bowl, whisk egg yolks until smooth. Add a ladleful of the hot cream mixture to the egg yolks and whisk to temper the yolks. Gradually pour the tempered yolks back into the saucepan, whisking constantly. Cook the mixture over low heat, stirring constantly, until it thickens enough to coat the back of a spoon. Remove the pan from the heat and whisk in matcha green tea powder until smooth. Pour the mixture into a container and chill for several hours in the refrigerator. Churn the mixture in an ice cream maker according to the manufacturer's instructions. Freeze the ice cream until firm",
          "rating": 4.8
        }
      ]
      
    }
  ]
  